{
  "backend/main.mo": "Motoko backend actor managing app owner, admin allowlist, user profiles, vendors, products, and authorization, with metadata queries and upgrade support.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, feature descriptions, related components, and test IDs for recent admin/app-owner updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles and behaviors of all major frontend files including routing, hooks, layouts, auth guards, and dashboard pages.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global background/foreground styles.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Defines the TanStack Router structure with public routes, protected admin/vendor areas, and app-wide layout and theming.",
  "frontend/src/components/auth/AuthControls.tsx": "Authentication control component handling Internet Identity login/logout, principal display, and role-mode clearing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guard component that checks admin or app-owner status and displays loading, error, or access-denied UI before rendering children.",
  "frontend/src/components/auth/RequireAuth.tsx": "Requires an authenticated Internet Identity session, showing loading or login UI until identity exists.",
  "frontend/src/components/auth/RequireRoleMode.tsx": "Ensures a role mode is selected and redirects to the role selection page if missing.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout with header, content area, and footer including a Caffeine.ai attribution link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Main navigation bar with links, role-aware admin access, and identity-based controls.",
  "frontend/src/components/status/ConnectionStatusCard.tsx": "Displays backend connection, environment, and authentication status with loading and error handling.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "Vendor product create/edit form handling validation, submission to backend, and error display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useMarketplaceQueries.ts": "Defines React Query hooks for fetching marketplace data such as products, vendors, and verified vendor lists using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Exposes queries for backend metadata, health checks, and user identity using the actor and Internet Identity state.",
  "frontend/src/hooks/useRoleMode.ts": "Manages user role mode (admin or vendor) with localStorage persistence and helper flags.",
  "frontend/src/index.css": "Tailwind CSS base file defining theme variables, light/dark color schemes, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPlaceholderPage.tsx": "Admin interface placeholder page enabling admin and vendor management actions via backend queries and mutations.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing marketplace introduction and navigation to product browsing and role selection.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays a single product’s details, handling loading, error states, vendor info, and navigation back to the product list.",
  "frontend/src/pages/PublicProductsPage.tsx": "Shows all published products with search and category filtering, plus loading and error handling.",
  "frontend/src/pages/RoleSelectPage.tsx": "Provides role selection between admin and vendor, checking authorization before navigation.",
  "frontend/src/pages/VendorLayoutPage.tsx": "Defines the vendor dashboard layout with tabs for profile and product management.",
  "frontend/src/pages/VendorPlaceholderPage.tsx": "Placeholder file with no implemented content.",
  "frontend/src/pages/VendorProductsPage.tsx": "Displays and manages the vendor’s products, including creating and editing items with dialogs.",
  "frontend/src/pages/VendorProfilePage.tsx": "Allows vendors to view and update their profile information with form handling and mutation feedback.",
  "frontend/src/pages/VendorsDirectoryPage.tsx": "Lists verified vendors in a grid with loading, error, and empty states, and supports navigation to individual vendor pages.",
  "frontend/src/pages/VendorStorefrontPage.tsx": "Displays a single vendor’s profile and products with loading and error states, using router params and marketplace query hooks.",
  "frontend/src/types/marketplace.ts": "Placeholder file for marketplace-related TypeScript types.",
  "frontend/src/utils/placeholders.ts": "Exports static placeholder image paths for products and vendor logos.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, plugins, and content paths for the project.",
  "project_state.json": "Describes the project’s current phase, architecture notes, known issues, and implemented features."
}