{
  "backend/main.mo": "Motoko backend defining app metadata, access control, user profiles, vendors, products, and authorization‑gated admin/user methods.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files, components, and test IDs for the updated admin permission flow.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of major frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind CSS base file defining color tokens, theming variables, and global styling for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining public, admin, and vendor routes with authentication and role guards.",
  "frontend/src/components/auth/AuthControls.tsx": "Auth control component handling Internet Identity login/logout and displaying the current principal.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard checking admin or app‑owner authorization and showing loading, error, or denial states.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard requiring Internet Identity login before accessing protected routes.",
  "frontend/src/components/auth/RequireRoleMode.tsx": "Role‑mode guard redirecting authenticated users to select-role when no role is chosen.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, content area, and footer including a dynamic year and referral link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Renders the top navigation bar with links, role-based admin access, and authentication controls.",
  "frontend/src/components/status/ConnectionStatusCard.tsx": "Displays backend connectivity, version info, and authentication status with loading and error handling.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "Form for creating or updating products, handling validation, backend submission, and error states.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor, refreshing related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useMarketplaceQueries.ts": "Contains React Query hooks to fetch and mutate marketplace data like products, vendors, and profiles via the actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks calling backend actor methods to fetch backend status, ping status, and caller identity.",
  "frontend/src/hooks/useRoleMode.ts": "Manages admin or vendor role mode in localStorage with helpers for setting and clearing roles.",
  "frontend/src/index.css": "Tailwind CSS base styles defining light/dark theme variables and global UI tokens.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AdminPlaceholderPage.tsx": "Admin dashboard placeholder implementing admin checks, vendor verification, admin management, and owner controls.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page outlining marketplace features and navigation to products and role selection.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays full product details, including price, image, vendor info, and handles loading and error states.",
  "frontend/src/pages/PublicProductsPage.tsx": "Public product list with search, category filtering, navigation to detail pages, and loading/error handling.",
  "frontend/src/pages/RoleSelectPage.tsx": "UI for choosing admin or vendor role, checking authorization and navigating accordingly.",
  "frontend/src/pages/VendorLayoutPage.tsx": "Vendor dashboard layout with tabs for profile and products, rendering child routes.",
  "frontend/src/pages/VendorPlaceholderPage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/VendorProductsPage.tsx": "Displays vendor products with loading/error states and dialogs for creating or editing products.",
  "frontend/src/pages/VendorProfilePage.tsx": "Vendor profile form allowing creation or updating of company info with loading and mutation states.",
  "frontend/src/pages/VendorsDirectoryPage.tsx": "Lists verified vendors with loading, error, and empty states, allowing navigation to individual storefronts.",
  "frontend/src/pages/VendorStorefrontPage.tsx": "Public vendor storefront showing vendor info and products, with loading and error handling.",
  "frontend/src/types/marketplace.ts": "Empty type file with no content.",
  "frontend/src/utils/placeholders.ts": "Exports static paths for product and vendor logo placeholder images.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist or clear them as needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Tracks project state, features, and pending authorization-related requests for admin permission flows and backend support."
}