{
  "backend/main.mo": "Marketplace canister implementing user and vendor profile CRUD with authorization checks and vendor verification logic.",
  "backend/migration.mo": "Migration module initializing empty maps and counters for user profiles and vendors when upgrading from an older actor.",
  "feature_evidence.json": "Feature evidence report mapping Phase 2 frontend features to files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color tokens, theming variables, and base layout rules for light and dark modes.",
  "frontend/index.html": "HTML root document loading the React app entrypoint and setting basic metadata.",
  "frontend/src/App.tsx": "Defines all application routes, authentication and role-mode protection, and wraps pages in the main layout and theme provider.",
  "frontend/src/components/auth/AuthControls.tsx": "Authentication UI showing sign-in and sign-out buttons with principal display and logout redirection.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component enforcing Internet Identity authentication and rendering a sign-in prompt when unauthenticated.",
  "frontend/src/components/auth/RequireRoleMode.tsx": "Route guard redirecting authenticated users to role selection if no role mode is chosen.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared layout with header, main content slot, and footer attribution used across all pages.",
  "frontend/src/components/layout/HeaderNav.tsx": "Renders the main navigation header with links, role badges, and auth controls, adapting options based on user identity and role mode.",
  "frontend/src/components/status/ConnectionStatusCard.tsx": "Displays backend connection and authentication status, showing loading, error, and identity checks using various hooks.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "Form for creating or editing vendor products with validation, state management, and mutation calls to backend queries.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMarketplaceQueries.ts": "React Query hooks for marketplace operations like fetching products, vendor profiles, and creating/updating items, with many placeholders for unimplemented backend calls.",
  "frontend/src/hooks/useQueries.ts": "Defines backend status, running state, and identity queries, mostly returning placeholders until backend methods are implemented.",
  "frontend/src/hooks/useRoleMode.ts": "Manages persisted role mode (admin or vendor) via localStorage with helpers to set and clear the mode.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS custom properties for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPlaceholderPage.tsx": "Displays a placeholder admin dashboard with planned feature cards and a connection status component.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with navigation to products and role selection plus Phase 1 feature highlights.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information with loading/error states, image display, and vendor lookup placeholder logic.",
  "frontend/src/pages/PublicProductsPage.tsx": "Fetches and displays public product listings with search, category filtering, and status alerts.",
  "frontend/src/pages/RoleSelectPage.tsx": "Allows authenticated users to choose admin or vendor mode and navigates accordingly.",
  "frontend/src/pages/VendorLayoutPage.tsx": "Provides the vendor dashboard layout with tab navigation between profile and products, rendering children within a styled container.",
  "frontend/src/pages/VendorPlaceholderPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/VendorProductsPage.tsx": "Displays the vendor’s products with loading/error states, product cards, and dialogs for creating or editing products.",
  "frontend/src/pages/VendorProfilePage.tsx": "Loads and edits vendor profile data with a form, handling save success and error states.",
  "frontend/src/types/marketplace.ts": "Defines marketplace product types including Product and ProductId used across the frontend.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, plugins, and container settings for the frontend.",
  "project_state.json": "Describes the project's phase, existing features, architectural notes, and known issues for planning."
}