{
  "backend/main.mo": "Actor implementing metadata, user profiles, and vendor profile management with permission checks and CRUD operations.",
  "backend/migration.mo": "Defines migration types and returns old actor state unchanged for upgrade compatibility.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML document loading the React app entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public, admin, and vendor routes wrapped in auth and role requirements.",
  "frontend/src/components/auth/AuthControls.tsx": "Login/logout UI using Internet Identity with principal display and role reset on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard displaying loading, sign-in prompt, or protected content based on identity state.",
  "frontend/src/components/auth/RequireRoleMode.tsx": "Ensures an authenticated user has selected admin or vendor mode, redirecting otherwise.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper with header, main content area, and footer including Caffeine attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation showing links based on authentication and role mode, including admin and vendor sections.",
  "frontend/src/components/status/ConnectionStatusCard.tsx": "Displays backend connection, environment info, and authentication status with loading and error handling.",
  "frontend/src/components/vendor/VendorProductForm.tsx": "Form for creating or editing vendor products with validation, category and currency options, and backend mutation handling.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and persistence via an auth client.",
  "frontend/src/hooks/useMarketplaceQueries.ts": "React Query hooks for fetching and mutating marketplace data including products, vendors, and profiles using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend status, ping checks, and identity lookup using the current actor.",
  "frontend/src/hooks/useRoleMode.ts": "LocalStorage‑backed hook for storing and managing the current admin or vendor role mode.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPlaceholderPage.tsx": "Displays an admin dashboard for viewing and verifying vendor profiles with loading, error, and empty states.",
  "frontend/src/pages/LandingPage.tsx": "Provides a marketing-style landing page with feature highlights and navigation to products and role selection.",
  "frontend/src/pages/ProductDetailPage.tsx": "Loads and displays detailed product information with pricing, image, and vendor data, handling loading and error states.",
  "frontend/src/pages/PublicProductsPage.tsx": "Shows a searchable, filterable list of published products with category selection and navigation to detail pages.",
  "frontend/src/pages/RoleSelectPage.tsx": "Lets authenticated users choose between admin or vendor roles, navigating accordingly and describing each role’s capabilities.",
  "frontend/src/pages/VendorLayoutPage.tsx": "Renders the vendor dashboard layout with tabs for profile and products, highlighting the active route and wrapping child content.",
  "frontend/src/pages/VendorPlaceholderPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/VendorProductsPage.tsx": "Displays the vendor’s product list with loading and error states, and supports creating and editing products via dialogs.",
  "frontend/src/pages/VendorProfilePage.tsx": "Allows vendors to view and edit their profile information, handling loading, success, and error states.",
  "frontend/src/pages/VendorsDirectoryPage.tsx": "Lists all verified vendors with loading and error states and links to individual vendor storefronts.",
  "frontend/src/pages/VendorStorefrontPage.tsx": "Shows a public vendor storefront with profile details and product listings, including loading and error handling.",
  "frontend/src/types/marketplace.ts": "Empty file with no defined marketplace types.",
  "frontend/src/utils/placeholders.ts": "Exports static placeholder image paths for product and vendor logo assets.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash‑based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH-based theme colors, typography, container queries, and animation utilities.",
  "project_state.json": "Project metadata describing current phase progression, architecture notes, known issues, and a list of existing scoped features for the multi-vendor marketplace."
}