{
  "kind": "build_request",
  "title": "Phase 5 next step: make backend state upgrade-safe with stable persistence + conditional migration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-83",
      "text": "Persist all marketplace backend state across canister upgrades by moving the current in-memory state in backend/main.mo into stable storage and implementing system upgrade hooks (preupgrade/postupgrade) that correctly round-trip the full state without data loss (including: accessControlState, userProfiles, vendors, products, lastVendorId, lastProductId, and any backend metadata needed for normal operation).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep moving to the next step"
        ]
      },
      "acceptanceCriteria": [
        "After creating vendor profiles and products, performing a canister upgrade, and reloading the app, vendor profiles and products are still present and readable via existing query APIs (e.g., getVerifiedVendorProfiles/getPublishedProducts/getProductById).",
        "After upgrade, ID allocation continues correctly (new vendor/product IDs do not collide with existing ones; lastVendorId/lastProductId reflect the next ID to assign).",
        "Access control behavior is unchanged after upgrade (admin-only endpoints remain admin-only; user endpoints remain user-only).",
        "preupgrade/postupgrade in backend/main.mo actually serialize and restore state (not just Debug.print), and no runtime traps occur during upgrade."
      ]
    },
    {
      "id": "REQ-84",
      "text": "Implement a conditional upgrade migration path that preserves already-deployed in-memory Map-based state when transitioning to the new stable persistence implementation, following the platform migration policy (create or update backend/migration.mo only if required by the policy).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep moving to the next step"
        ]
      },
      "acceptanceCriteria": [
        "If the platform migration policy requires a migration module, backend/migration.mo exists and upgrades preserve pre-existing deployed state (vendors/products/userProfiles/counters/access control).",
        "If the platform migration policy does not require a migration module, no migration.mo is added and upgrades still preserve state via stable storage hooks in backend/main.mo.",
        "Migration logic (if present) is idempotent and does not duplicate records or reset counters when applied more than once."
      ]
    },
    {
      "id": "REQ-85",
      "text": "Add minimal, non-user-facing backend sanity checks/logging around upgrade hooks (and any migration, if present) to help diagnose upgrade issues without exposing sensitive data or changing user-facing behavior.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep moving to the next step"
        ]
      },
      "acceptanceCriteria": [
        "Upgrade-related logs are limited to non-sensitive diagnostics (e.g., counts, version numbers, counter values) and do not print user profile contents or other sensitive fields.",
        "Normal API responses and UI behavior are unchanged aside from upgrade persistence improvements."
      ]
    },
    {
      "id": "REQ-86",
      "text": "Ensure the existing admin-only upgrade diagnostics endpoint getUpgradeSummary accurately reflects the persisted state after upgrades (counts and counters match reality) so the Admin Dashboard upgrade verification UI can be used to validate upgrade preservation before vs. after deployments.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep moving to the next step"
        ]
      },
      "acceptanceCriteria": [
        "Calling getUpgradeSummary as an admin returns vendorCount/productCount that match the actual number of stored vendors/products after an upgrade.",
        "getUpgradeSummary.lastVendorId/lastProductId match the persisted counters after an upgrade and remain consistent with the next created IDs.",
        "getUpgradeSummary remains admin-gated (non-admin callers receive an authorization trap as before)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Create backend/migration.mo only if required by the platform's conditional migration policy.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add payments, checkout, or any financial processing.",
    "Do not introduce a complex roles/permissions matrix beyond the existing admin/vendor mode approach.",
    "Do not add external databases or third-party backend infrastructure.",
    "Do not change public API shapes unless strictly required for upgrade-safe persistence (prefer backward-compatible changes)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}