{
  "kind": "build_request",
  "title": "Add stable storage + upgrade hooks to unblock error-free deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "Persist all marketplace state across canister upgrades by moving the in-memory state in backend/main.mo into stable storage, including: access control state, userProfiles, vendors, products, lastVendorId, and lastProductId.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Add stable storage for vendors, products, user profiles, and ID counters.",
          "Yes please go ahead and thanks"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo uses stable variables (directly or via stable serialization structures) so that vendor profiles, products, user profiles, access control state, and ID counters can survive upgrades.",
        "After an upgrade, existing vendors/products/user profiles created before the upgrade are still returned by the relevant query methods (e.g., getVerifiedVendorProfiles/getPublishedProducts/getCallerVendorProfile/getCallerProducts/getCallerUserProfile)."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Implement upgrade-safe serialization and restoration for backend state by adding system upgrade hooks in backend/main.mo (preupgrade/postupgrade) that correctly round-trip all persisted state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Add preupgrade/postupgrade hooks so the canister can safely upgrade.",
          "Yes please go ahead and thanks"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo includes system func preupgrade() and system func postupgrade().",
        "preupgrade captures all required state into stable storage; postupgrade restores in-memory structures so existing APIs continue to work without behavioral changes.",
        "Upgrade hooks do not change any user-facing error messages or authorization behavior for existing endpoints."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add a conditional migration path following the platform migration policy to preserve already-deployed in-memory Map-based state when transitioning to stable storage; create backend/migration.mo only if required by the platform policy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Add stable-storage and migration support.",
          "Yes please go ahead and thanks"
        ]
      },
      "acceptanceCriteria": [
        "If the platform migration policy requires backend/migration.mo, it is added and used to preserve state during the transition; otherwise, no migration file is added.",
        "The chosen approach (with or without backend/migration.mo) results in successful canister upgrade deployment without losing state created before the upgrade."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Add minimal backend-level (non-user-facing) sanity checks/logging around upgrade hooks/migration to help diagnose upgrade issues without changing user-facing behavior.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Add minimal backend-level sanity checks/logging (non-user-facing) around upgrade hooks/migration to help diagnose upgrade issues without changing user-facing behavior.",
          "Yes please go ahead and thanks"
        ]
      },
      "acceptanceCriteria": [
        "Upgrade hooks/migration include minimal diagnostics suitable for debugging upgrade issues (no UI changes, no new frontend text).",
        "No additional public APIs are introduced solely for logging/debugging."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; keep all Motoko logic in backend/main.mo.",
    "Generate backend/migration.mo only when required by the platform’s conditional migration policy.",
    "Do not modify files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new marketplace features (payments, analytics, roles/permissions expansion, multi-organization support, etc.).",
    "Do not change existing frontend UX/copy as part of this deployment-unblocker work.",
    "Do not introduce additional backend canisters or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}