{
  "kind": "build_request",
  "title": "Implement next permission step: backend caller-admin + admin-count APIs and update admin bootstrap UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query method to check whether the *caller* is in the persisted admin allowlist, so the frontend can reliably determine admin access without needing to pass a principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Proceed to the next step please"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo exposes a query method named isCallerAdmin() : async Bool",
        "isCallerAdmin() returns true iff caller exists in adminAllowlist",
        "Method does not trap for anonymous/authenticated callers (it simply returns Bool)",
        "Frontend can call this method successfully via the generated actor interface"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a backend query method that allows any caller (including non-admins) to determine whether the deployment has any admins yet, so the UI can safely show the 'Claim Initial Admin' bootstrap action without calling admin-guarded endpoints.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Proceed to the next step please"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo exposes a query method (e.g., getAdminCount() : async Nat, or equivalent) that does not require admin/app-owner authorization",
        "The method returns the current size of adminAllowlist",
        "The method does not trap for non-admin callers",
        "No existing admin-guarded behavior (e.g., getAdmins/addAdmin/removeAdmin) is weakened by this change"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend admin permission flow to use the new backend methods so that (a) admin checks do not fail due to missing backend APIs and (b) the Admin Dashboard can decide whether to show 'Claim Initial Admin' without calling admin-guarded getAdmins() when the viewer is not authorized.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Proceed to the next step please"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/useMarketplaceQueries.ts uses actor.isCallerAdmin() for useIsCallerAdmin (matching the new backend API)",
        "A new React Query hook exists to read the admin count / 'any admins exist' signal from the backend (using the new public backend query)",
        "frontend/src/pages/AdminPlaceholderPage.tsx no longer relies on getAdmins() succeeding for unauthorized users in order to decide whether to show 'Claim Initial Admin'",
        "When a signed-in non-admin visits /admin and no admins exist, the UI can render the 'Claim Initial Admin' action without showing an authorization error from getAdmins()",
        "When admins already exist, the UI does not show 'Claim Initial Admin' and instead shows appropriate guidance for non-authorized users",
        "All user-facing text related to these flows remains in English"
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: implement changes in backend/main.mo (no additional canisters).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Do not weaken existing authorization checks on admin-only operations (getAdmins/setAdmins/addAdmin/removeAdmin/verifyVendor/getAllVendorProfiles/getUpgradeSummary)."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding complex roles/permission matrices beyond the existing Admin allowlist + App Owner concept.",
    "Adding persistence migration/stable storage changes unless strictly required for these new methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}