{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update admin bootstrap UI to use public admin-existence signal and caller-admin checks",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update frontend admin permission flow to use the new backend caller-admin and admin-count/has-admin queries, avoiding unauthorized getAdmins() calls for bootstrap decisions.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useMarketplaceQueries.ts uses actor.isCallerAdmin() for useIsCallerAdmin (matching the new backend API)",
        "A new React Query hook exists to read the admin count / 'any admins exist' signal from the backend (using the new public backend query)",
        "frontend/src/pages/AdminPlaceholderPage.tsx no longer relies on getAdmins() succeeding for unauthorized users in order to decide whether to show 'Claim Initial Admin'",
        "When a signed-in non-admin visits /admin and no admins exist, the UI can render the 'Claim Initial Admin' action without showing an authorization error from getAdmins()",
        "When admins already exist, the UI does not show 'Claim Initial Admin' and instead shows appropriate guidance for non-authorized users",
        "All user-facing text related to these flows remains in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMarketplaceQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook to read the public \"any admins exist\" signal from the backend (e.g., actor.hasAdmin() or equivalent) and, if needed, update the existing useGetAdmins hook to support disabling the query for unauthorized viewers so AdminPlaceholderPage can avoid calling admin-guarded methods."
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Update the /admin guard logic to incorporate the public \"any admins exist\" signal: if no admins exist yet, allow rendering the admin bootstrap UI (or render a dedicated in-guard bootstrap call-to-action) even when the viewer is not currently an admin/app owner; otherwise, keep the existing access-denied behavior for non-authorized users."
        },
        {
          "path": "frontend/src/pages/AdminPlaceholderPage.tsx",
          "operation": "modify",
          "description": "Refactor admin bootstrap decision logic to use the new public \"any admins exist\" hook instead of relying on getAdmins() for unauthorized users; ensure getAdmins() is only executed when the viewer is authorized (admin/app owner) for admin management UI, and keep all user-facing text in English."
        }
      ]
    }
  ]
}